In [1]:
import pandas as pd
import glob

## Extract

In [2]:
df = pd.concat(map(pd.read_csv, glob.glob('input/*.csv')))
#Extract All source code
#https://stackoverflow.com/questions/20906474/import-multiple-csv-files-into-pandas-and-concatenate-into-one-dataframe

In [3]:
df.head()

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed
0,0,jacareacanga,0,BR,1528902000,62,-6.22,-57.76,89.60,6.93
1,1,kaitangata,100,NZ,1528905304,94,-46.28,169.85,42.61,5.64
2,2,goulburn,20,AU,1528905078,91,-34.75,149.72,44.32,10.11
3,3,lata,76,IN,1528905305,89,30.78,78.62,59.89,0.94
4,4,chokurdakh,0,RU,1528905306,88,70.62,147.90,32.17,2.95

In [4]:
len(df)

1095

## Transform

In [5]:
df['hash'] = pd.Series((hash(tuple(row)) for _, row in df.iterrows()))
#Hash Code
#https://stackoverflow.com/questions/25757042/create-hash-value-for-each-row-of-data-with-selected-columns-in-dataframe-in-pyt
df.head()

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed,hash
0,0,jacareacanga,0,BR,1528902000,62,-6.22,-57.76,89.60,6.93,-1625669663818752798
1,1,kaitangata,100,NZ,1528905304,94,-46.28,169.85,42.61,5.64,2734567828028643346
2,2,goulburn,20,AU,1528905078,91,-34.75,149.72,44.32,10.11,1117517490766594019
3,3,lata,76,IN,1528905305,89,30.78,78.62,59.89,0.94,1699187215842811681
4,4,chokurdakh,0,RU,1528905306,88,70.62,147.90,32.17,2.95,-5962522836276746445

In [6]:
len(df)

1095

In [7]:
df_nodupe = df[~df.duplicated()]
#Dedupe code source
#https://stackoverflow.com/questions/40438237/assign-hash-to-row-of-categorical-data-in-pandas

In [8]:
df_nodupe.head()

,City_ID,City,Cloudiness,Country,Date,Humidity,Lat,Lng,Max Temp,Wind Speed,hash
0,0,jacareacanga,0,BR,1528902000,62,-6.22,-57.76,89.60,6.93,-1625669663818752798
1,1,kaitangata,100,NZ,1528905304,94,-46.28,169.85,42.61,5.64,2734567828028643346
2,2,goulburn,20,AU,1528905078,91,-34.75,149.72,44.32,10.11,1117517490766594019
3,3,lata,76,IN,1528905305,89,30.78,78.62,59.89,0.94,1699187215842811681
4,4,chokurdakh,0,RU,1528905306,88,70.62,147.90,32.17,2.95,-5962522836276746445

In [9]:
len(df_nodupe)

548

## Load

#### > Convert DataFrame to json formatted file

In [10]:
import json

In [11]:
df_nodupe.to_json('ETL_json_file', orient='index')
# Converting dataframe data to json format
# https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_json.html

In [12]:
json_data = df_nodupe.to_json(orient='index')
parsed = json.loads(json_data)
# print(json.dumps(parsed, indent=4, sort_keys=True))
# Un-comment print to pretty print json formated data

#### > Create MongoDB named 'etl_db' with a collection 'etl_data'

In [13]:
import pymongo
from pymongo import MongoClient
client = MongoClient()
client = MongoClient('localhost', 27017)
client = MongoClient('mongodb://localhost:27017/')
print('Mongo version', pymongo.__version__)

Mongo version 3.9.0

In [14]:
#client.drop_database('etl_db')
db = client['etl_db']
# Create database named 'etl_db'

db.etl_data.drop() # Drop collection if it already exist

collection = db['etl_data']
# Create collection called 'etl_data'

#### > Load ETL_json_file data

In [15]:
with open('ETL_json_file') as f:
    file_data = json.load(f)
    collection.insert_one(file_data) 
client.close()
# Read json file into mongoDB
# https://stackoverflow.com/questions/49510049/how-to-import-json-file-to-mongodb-using-python

In [16]:
db.list_collection_names()
# List collections in database

['etl_data']

In [17]:
db.etl_data.find( { 0: {} } )

In [18]:
# cursor = db.etl_data # selecting the etl_data collection
# for document in cursor.find():
#    print (document)
# Printing the content of the collection LARGE PRINTOUT

#### > Reading content of database and loading it into a dataframe

In [19]:
extracted_etl_data = db.etl_data
df = pd.DataFrame(list(extracted_etl_data.find()))
# https://stackoverflow.com/questions/16249736/how-to-import-data-from-mongodb-to-pandas

In [20]:
df

,0,1,10,100,101,102,103,104,105,106,...,91,92,93,94,95,96,97,98,99,_id
0,"{'City_ID': 0, 'City': 'jacareacanga', 'Cloudi...","{'City_ID': 1, 'City': 'kaitangata', 'Cloudine...","{'City_ID': 10, 'City': 'puerto ayora', 'Cloud...","{'City_ID': 100, 'City': 'auchel', 'Cloudiness...","{'City_ID': 101, 'City': 'bubaque', 'Cloudines...","{'City_ID': 102, 'City': 'khatanga', 'Cloudine...","{'City_ID': 103, 'City': 'los banos', 'Cloudin...","{'City_ID': 104, 'City': 'labuhan', 'Cloudines...","{'City_ID': 105, 'City': 'saint-paul', 'Cloudi...","{'City_ID': 106, 'City': 'petatlan', 'Cloudine...",...,"{'City_ID': 91, 'City': 'mataura', 'Cloudiness...","{'City_ID': 92, 'City': 'buala', 'Cloudiness':...","{'City_ID': 93, 'City': 'eyl', 'Cloudiness': 2...","{'City_ID': 94, 'City': 'abu dhabi', 'Cloudine...","{'City_ID': 95, 'City': 'tahe', 'Cloudiness': ...","{'City_ID': 96, 'City': 'chuy', 'Cloudiness': ...","{'City_ID': 97, 'City': 'dzerzhinskoye', 'Clou...","{'City_ID': 98, 'City': 'vanavara', 'Cloudines...","{'City_ID': 99, 'City': 'muros', 'Cloudiness':...",5d6d25c53eb3305b9fdb8251

In [21]:
df = df.melt()

In [22]:
df.head()

  variable                                              value
0        0  {'City_ID': 0, 'City': 'jacareacanga', 'Cloudi...
1        1  {'City_ID': 1, 'City': 'kaitangata', 'Cloudine...
2       10  {'City_ID': 10, 'City': 'puerto ayora', 'Cloud...
3      100  {'City_ID': 100, 'City': 'auchel', 'Cloudiness...
4      101  {'City_ID': 101, 'City': 'bubaque', 'Cloudines...

In [23]:
len(df)

549

In [24]:
df.iloc[0][1]
# Showing content of first row 'value'

{'City_ID': 0,
 'City': 'jacareacanga',
 'Cloudiness': 0,
 'Country': 'BR',
 'Date': 1528902000,
 'Humidity': 62,
 'Lat': -6.22,
 'Lng': -57.76,
 'Max Temp': 89.6,
 'Wind Speed': 6.93,
 'hash': -1625669663818752798}